export type ProvinceData = {
    name: string
    cities: string[]
}

export const iranProvinces: ProvinceData[] = [
    {
        name: 'آذربایجان شرقی',
        cities: [
            'تبریز', 'مراغه', 'میانه', 'مرند', 'اهر', 'بناب', 'سراب', 'آذرشهر',
            'اسکو', 'ملکان', 'شبستر', 'عجب‌شیر', 'بستان‌آباد', 'هشترود', 'کلیبر',
            'خداآفرین', 'ورزقان', 'جلفا', 'هریس', 'چاراویماق', 'ممقان', 'تسوج', 'ایلخچی', "سایر..."
        ]
    },
    {
        name: 'آذربایجان غربی',
        cities: [
            'ارومیه', 'خوی', 'مهاباد', 'بوکان', 'سلماس', 'میاندوآب', 'پیرانشهر',
            'نقده', 'سردشت', 'شاهین‌دژ', 'ماکو', 'تکاب', 'شنو (اشنویه)', 'پلدشت',
            'چایپاره', 'باروق', 'چهاربرج', 'سیلوانه', 'بازرگان', "سایر..."
        ]
    },
    {
        name: 'اردبیل',
        cities: [
            'اردبیل', 'پارس‌آباد', 'مشگین‌شهر', 'خلخال', 'گرمی', 'نمین',
            'بیله‌سوار', 'کوثر', 'نیر', 'اصلاندوز', "سایر..."
        ]
    },
    {
        name: 'اصفهان',
        cities: [
            'اصفهان', 'کاشان', 'نجف‌آباد', 'خمینی‌شهر', 'شاهین‌شهر', 'مبارکه',
            'برخوار (دولت‌آباد)', 'لنجان (زرین‌شهر)', 'فلاورجان', 'گلپایگان',
            'فریدن (داران)', 'سمیرم', 'شهرضا', 'تیران و کرون', 'اردستان', 'نائین',
            'خوانسار', 'نطنز', 'خور و بیابانک', 'فریدون‌شهر', 'چادگان', 'بوئین میاندشت',
            'بهارستان', 'گزبرخوار', 'ورزنه', 'تودشک', 'زیار', "سایر..."
        ]
    },
    {
        name: 'البرز',
        cities: [
            'کرج', 'فردیس', 'نظرآباد', 'هشتگرد (ساوجبلاغ)', 'نظرآباد', 'اشتهارد',
            'طالقان', 'محمدشهر', 'ماهدشت', 'کمال‌شهر', 'مشکین‌دشت', 'شهر جدید هشتگرد', "سایر..."
        ]
    },
    {
        name: 'ایلام',
        cities: [
            'ایلام', 'دهلران', 'ایوان', 'آبدانان', 'دره‌شهر', 'ملکشاهی',
            'چرداول (سرابله)', 'مهران', 'بدره', 'هلیلان', "سایر..."
        ]
    },
    {
        name: 'بوشهر',
        cities: [
            'بوشهر', 'برازجان (دشتستان)', 'بندر کنگان', 'بندر گناوه', 'خورموج (دشتی)',
            'جم', 'عسلویه', 'دیر', 'دیلم', 'تنگستان (اهرم)', "سایر..."
        ]
    },
    {
        name: 'تهران',
        cities: [
            'تهران', 'اسلامشهر', 'شهریار', 'بهارستان (گلستان/صالحیه)', 'ملارد',
            'پاکدشت', 'ری', 'رباط‌کریم', 'قدس', 'دماوند', 'قرچک', 'ورامین',
            'پردیس', 'پیشوا', 'فیروزکوه', 'رودهن', 'بومهن', 'باقرشهر', 'کهریزک', 'شاهدشهر', "سایر..."
        ]
    },
    {
        name: 'چهارمحال و بختیاری',
        cities: [
            'شهرکرد', 'بروجن', 'لردگان', 'فارسان', 'کیار (شلغان)', 'اردل',
            'بن', 'سامان', 'خانمیرزا', 'فلارد', "سایر..."
        ]
    },
    {
        name: 'خراسان جنوبی',
        cities: [
            'بیرجند', 'قائن (قائنات)', 'طبس', 'فردوس', 'نهبندان',
            'سرایان', 'سربیشه', 'بشرویه', 'درمیان', 'خوسف', "سایر..."
        ]
    },
    {
        name: 'خراسان رضوی',
        cities: [
            'مشهد', 'سبزوار', 'نیشابور', 'تربت حیدریه', 'کاشمر', 'قوچان',
            'تربت جام', 'چناران', 'خواف', 'تايباد', 'گناباد', 'برزکن', 'فریمان',
            'درگز', 'سرخس', 'باخرز', 'رشتخوار', 'بجستان', 'خلیل‌آباد', 'کلات',
            'طرقبه', 'شاندیز', 'گلبهار', 'نصرآباد', "سایر..."
        ]
    },
    {
        name: 'خراسان شمالی',
        cities: [
            'بجنورد', 'شیروان', 'اسفراین', 'آشخانه (مانه و سملقان)',
            'جاجرم', 'گرمه', 'فاروج', 'راز و جرگلان', "سایر..."
        ]
    },
    {
        name: 'خوزستان',
        cities: [
            'اهواز', 'دزفول', 'آبادان', 'بندر ماهشهر', 'خرمشهر', 'اندیمشک',
            'ایذه', 'بهبهان', 'شوشتر', 'شادگان', 'بندر امام خمینی', 'مسجدسلیمان',
            'شوش', 'رامهرمز', 'باغملک', 'حمیدیه', 'کارون (کوت عبدالله)', 'شادگان',
            'هندیجان', 'لالی', 'اندیکا', 'هویزه', 'آغاجاری', "سایر..."
        ]
    },
    {
        name: 'زنجان',
        cities: [
            'زنجان', 'ابهر', 'خرمدره', 'قیدار (خدابنده)', 'ماهنشان',
            'سلطانیه', 'آب‌بر (طارم)', 'ایجرود (زرین‌آباد)', "سایر..."
        ]
    },
    {
        name: 'سمنان',
        cities: [
            'سمنان', 'شاهرود', 'دامغان', 'گرمسار', 'مهدی‌شهر',
            'سرخه', 'میامی', 'ارادان', "سایر..."
        ]
    },
    {
        name: 'سیستان و بلوچستان',
        cities: [
            'زاهدان', 'زابل', 'ایرانشهر', 'چابهار', 'سراوان', 'خاش',
            'کنارک', 'سیب و سوران', 'مهرستان', 'دلگان', 'نیمروز', 'هامون',
            'هیرمند', 'فنوج', 'نیک‌شهر', 'قصرقند', 'میرجاوه', 'راسک', "سایر..."
        ]
    },
    {
        name: 'فارس',
        cities: [
            'شیراز', 'مرودشت', 'جهرم', 'فسا', 'کازرون', 'لارستان (لار)',
            'داراب', 'فیروزآباد', 'آباده', 'لامرد', 'اقلید', 'استهبان', 'نی‌ریز',
            'زرین‌دشت', 'ممسنی (نورآباد)', 'کوار', 'خرامه', 'مهر', 'خنج',
            'پارس‌آباد', 'بوانات', 'سپیدان (اردکان)', 'رستم', 'سروستان', 'بیضا', 'آباده طشک', "سایر..."
        ]
    },
    {
        name: 'قزوین',
        cities: [
            'قزوین', 'البرز (الوند)', 'تاکستان', 'بوئین‌زهرا', 'آبیک', 'محمودآباد نمونه',
            'آوج', 'خسروشاه', "سایر..."
        ]
    },
    {
        name: 'قم',
        cities: [
            'قم', 'دستجرد', 'قنوات', 'جعفریه', 'کهک', "سایر..."
        ]
    },
    {
        name: 'کردستان',
        cities: [
            'سنندج', 'سقز', 'مریوان', 'بانه', 'قروه', 'کامیاران',
            'بیجار', 'دیواندره', 'دهگلان', 'سروآباد', "سایر..."
        ]
    },
    {
        name: 'کرمان',
        cities: [
            'کرمان', 'سیرجان', 'رفسنجان', 'جیرفت', 'بم', 'زرند',
            'کهنوج', 'شهر بابک', 'بافت', 'بردسیر', 'عنبرآباد', 'فهرج',
            'منوجان', 'رودبار جنوب', 'رابر', 'نرماشیر', 'قلعه‌گنج', 'کوهبنان', "سایر..."
        ]
    },
    {
        name: 'کرمانشاه',
        cities: [
            'کرمانشاه', 'اسلام‌آباد غرب', 'جوانرود', 'کنگاور', 'سنقر',
            'پاوه', 'سرپل ذهاب', 'صحنه', 'هرسین', 'گیلانغرب', 'روانسر',
            'قصر شیرین', 'ثلاث باباجانی', 'دالاهو', "سایر..."
        ]
    },
    {
        name: 'کهگیلویه و بویراحمد',
        cities: [
            'یاسوج', 'دوگنبدان (گچساران)', 'دهدشت (کهگیلویه)', 'چرام',
            'لیکک (بهمئی)', 'باشت', 'لنده', 'مارگون', "سایر..."
        ]
    },
    {
        name: 'گلستان',
        cities: [
            'گرگان', 'گنبد کاووس', 'علی‌آباد کتول', 'بندر ترکمن', 'آق‌قلا',
            'کردکوی', 'بندر گز', 'آزادشهر', 'مینودشت', 'رامیان', 'کلاله',
            'مراوه‌تپه', 'گالیکش', "سایر..."
        ]
    },
    {
        name: 'گیلان',
        cities: [
            'رشت', 'بندر انزلی', 'لاهیجان', 'لنگرود', 'هشتپر (تالش)',
            'رودسر', 'آستارا', 'صومعه‌سرا', 'آستانه اشرفیه', 'فومن',
            'رودبار', 'شفت', 'رضوانشهر', 'ماسال', 'سیاهکل', 'املش', "سایر..."
        ]
    },
    {
        name: 'لرستان',
        cities: [
            'خرم‌آباد', 'بروجرد', 'دورود', 'الیگودرز', 'کوهدشت',
            'پلدختر', 'سلسله (الشتر)', 'دلفان (نورآباد)', 'ازنا', 'چگنی', 'معمولان', "سایر..."
        ]
    },
    {
        name: 'مازندران',
        cities: [
            'ساری', 'بابل', 'آمل', 'قائم‌شهر', 'بهشهر', 'چالوس',
            'نوشهر', 'تنکابن', 'بابلسر', 'فریدونکنار', 'نکا', 'رامسر',
            'محمودآباد', 'جویبار', 'سوادکوه (پل سفید)', 'عباس‌آباد', 'کلاردشت',
            'گلوگاه', 'میاندورود', 'سیمرغ', "سایر..."
        ]
    },
    {
        name: 'مرکزی',
        cities: [
            'اراک', 'ساوه', 'خمین', 'محلات', 'دلیجان', 'شازند',
            'تفرش', 'آشتیان', 'فراهان', 'زرندیه (مامونیه)', 'خنداب', "سایر..."
        ]
    },
    {
        name: 'هرمزگان',
        cities: [
            'بندرعباس', 'قشم', 'میناب', 'بندر لنگه', 'کی‌ش', 'رودان',
            'جاسک', 'حاجی‌آباد', 'بستک', 'پارسیان', 'بندر سیریک', 'ابوموسی', "سایر..."
        ]
    },
    {
        name: 'همدان',
        cities: [
            'همدان', 'ملایر', 'نهاوند', 'تویسرکان', 'کبودرآهنگ',
            'اسدآباد', 'بهار', 'رزن', 'فامنین', 'درگزین', "سایر..."
        ]
    },
    {
        name: 'یزد',
        cities: [
            'یزد', 'میبد', 'اردکان', 'بافق', 'مهریز', 'ابرقو',
            'اشکذر', 'هرات (خاتم)', 'مروست', 'تفت', "سایر..."
        ]
    }
]

export const provinceNames = iranProvinces.map(p => p.name)

export function getCitiesOfProvince(provinceName: string): string[] {
    return iranProvinces.find(p => p.name === provinceName)?.cities ?? []
}